while True:
    print(
        "Welcome To Waste Your Time btw who I am A righteous and Straight Forward person (sometime) And hope You will solve every problem in life my little 'DIAMOND' in coal mine")

    ChoiceA = input('Which path do u wanna choose? "Left" or "Right"? ').strip().lower()
    if ChoiceA == "right":
        choice2 = input('You have chosen Right path. You can now move "forward" or "backward"? ').strip().lower()
        if choice2 == "forward":
            choice3 = input('Champions mindset! But it gets tougher. "Play" or "quit"? ').strip().lower()
            if choice3 == "play":
                print("Good Boi lets play together 😍")
                Chooice4 = input("Hard level!\n"
                                 "Hint: Use your GK, this may be tricky for you but easy for me.\n"
                                 "There are Two doors choose one '1' and '2' :\n"
                                 "1. A polar bear who is friendly\n"
                                 "2. A lion who just had food\n").strip()

                if Chooice4 == "2":
                    print("Yo you got General knowledge! You may proceed 😃")
                    choice5 = input(
                        "OK then Now there are 3 Room which are abandoned or locked for months but one of those rooms has a way to escape so let's see which one you choose\n"
                        "Hint: Use Your brain '1','2' and '3':\n"
                        "1. A Room filled with venomous snakes\n"
                        "2. A Room which has bloodthirsty tiger\n"
                        "3. A Room which has 7ft psycho hungry serial killer who has an axe and a gun and likes human meat\n").strip().lower()
                    if choice5 == "3":
                        print(
                            "Hm.... You got brain or was just a random guess😒, whatever man! Guess what u won a chance to play ahead, isn't it cool 😁")
                        choice6 = input("Now now 🤓 Yk there's been a murder 🔪🥺\n"
                                        "Scenario: An elderly person around 75 was killed. Who would be that heartless bastard?\n"
                                        "He was the owner of a million dollar company, rude, disrespectful, even slapped his manager once.\n"
                                        "He was found dead in his office on 23 August around 2pm. Only his manager and family were allowed to enter.\n"
                                        "The police were called when an employee discovered the body.\n"
                                        "Who killed him?\n"
                                        "Choose: '1','2','3','4'\n"
                                        "1. Family Member\n"
                                        "2. Manager\n"
                                        "3. Employee\n"
                                        "4. Michael\n").strip().lower()
                        if choice6 == "3":
                            print(
                                "You got some quiet reading skill and some IQ — you guessed right! The employee was the murderer.")
                            choice7 = input("Now let's move toward our next quiz — it's quite easy tho\n"
                                            "Which of these words did I USE earlier in our conversation?\n"
                                            "Choose: '1','2','3','4'\n"
                                            "1. Belittle\n"
                                            "2. Lioness\n"
                                            "3. Diamond\n"
                                            "4. Psychiatric\n").strip().lower()
                            if choice7 == "3":
                                print(
                                    "Yup that's correct — you got quite a memory or did you just cheat 🤨, whatever man you move ahead")
                                choice8 = input("Yo! It's time for another murder mystery\n"
                                                "Scenario: Another millionaire, owner of a company, got killed.\n"
                                                "He was hardworking, even worked on holidays, and visited his office daily.\n"
                                                "He went to his office on 25 Dec around 8 a.m.\n"
                                                "Who killed him?\n"
                                                "Choose: '1','2','3','4','5'\n"
                                                "1. Watchman who called police for help\n"
                                                "2. Cristina who called watchman for help\n"
                                                "3. Jack who called Cristina for help\n"
                                                "4. Watchman, Jack, Cristina\n"
                                                "5. Cristina, Jack\n").strip().lower()
                                if choice8 == "5":
                                    print(
                                        "Yup you are absolutely right what where they doing there on holiday stupid people, btw U got a lot iq boi u won")
                                    choice9 = input("Last Round boi:\n"
                                                    "In this Round Every thing depends on luck You got iq lets see if god favour u or u got some luck or not\n"
                                                    "Choose '1' Or '2'\n"
                                                    "       1.Head"
                                                    "       2.Tail\n").strip().lower()
                                    if choice9 == "1":
                                        print('''
                                                                       .##..##..######...####...#####..
                                                                       .##..##..##......##..##..##..##.
                                                                       .######..####....######..##..##.
                                                                       .##..##..##......##..##..##..##.
                                                                       .##..##..######..##..##..#####..
                                                                       ................................\n
                                                                      .#####...#####....####..
                                                                      .##..##..##..##..##..##.
                                                                      .#####...#####...##..##.
                                                                      .##..##..##..##..##..##.
                                                                      .#####...##..##...####..
                                                                      ........................\n
                                                                      .##..##...####...##..##.
                                                                      ..####...##..##..##..##.
                                                                      ...##....##..##..##..##.
                                                                      ...##....##..##..##..##.
                                                                      ...##.....####....####..
                                                                      ........................\n
                                                                      .##...##...####...##..##.
                                                                      .##...##..##..##..###.##.
                                                                      .##.#.##..##..##..##.###.
                                                                      .#######..##..##..##..##.
                                                                      ..##.##....####...##..##.
                                                                      .........................\n
                                                                      .##...##..##..##.
                                                                      .###.###...####..
                                                                      .##.#.##....##...
                                                                      .##...##....##...
                                                                      .##...##....##...
                                                                      .................\n
                                                                      .#####...##......######...####....####...######..##..##...####..
                                                                      .##..##..##......##......##......##........##....###.##..##.....
                                                                      .#####...##......####.....####....####.....##....##.###..##.###.
                                                                      .##..##..##......##..........##......##....##....##..##..##..##.
                                                                      .#####...######..######...####....####...######..##..##...####..
                                                                      ................................................................\n
                                                                      ..####...##..##..#####..
                                                                      .##..##..###.##..##..##.
                                                                      .######..##.###..##..##.
                                                                      .##..##..##..##..##..##.
                                                                      .##..##..##..##..#####..
                                                                      ........................\n
                                                                      ..####..
                                                                      .##..##.
                                                                      .######.
                                                                      .##..##.
                                                                      .##..##.
                                                                      ........\n
                                                                      ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠐⠠⠄⠄⠄⠀⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠄⢀⠀⠤⠠⠄⠠⠀⢀⠀⠀⠀⠀⠀⠀⠈⠀⠂⠐⠀⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠌⠀⠀⠀⡁⠀⠀⠁⠈⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠈⠄⠀⠐⠀⠀⠀⠀⠄⠀⠀⠀⠀⡀⠀⠄⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡐⠀⠀⠀⠠⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠈⠀⠀⠀⠈⠐⡀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠂⡄⠁⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡀⣄⣄⢳⠶⣶⣶⠶⠶⠖⠶⠶⢶⡶⣶⣶⣶⣶⠤⢄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢔⠋⠑⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⢯⣾⣿⣿⣿⣿⣿⣿⣾⣕⡦⡀⠀⠀⠀⠀⠀⠀⠐⠀⠁⠠⠀⢂
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣄⡔⠉⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡏⡘⣫⣿⣿⣿⣿⣿⡼⣿⡿⢿⢘⣷⣄⣀⡀⠐⠀⠰⠀⠀⠐⠀⠂
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣠⣤⣦⣪⣷⣶⣶⣶⣶⣶⣶⣲⣶⣶⣶⣶⣶⣶⣶⣶⣾⡟⣀⣨⣿⣭⣿⣿⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣷⠀⢀⠠⠀⠀⠀⠂⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠈⠠⠀⠀⠠⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⣿⣿⢟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⢿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠈⠹⣿⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⢀⠀⡀⢀⢀⡀⠄⣠⣀⣾⠀⠀⠀⣜⠀⠀⠀⠀⣹⣿⠯⠍⠛⠠⠀⠒⣲⢽⣿⣿⣻⠟⠉⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⡜⠉⢂⡟⠠⡀⠤⢀⠄⡀⢀
                                                            ⢌⡸⣨⠕⣎⠇⡌⡀⣿⣿⣿⣖⣦⣤⣿⣤⣤⣤⣴⣿⣿⣷⣶⣶⣶⣶⣶⣾⣿⣿⣿⠏⠀⠞⠁⠉⢄⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢠⢁⠄⠈⡗⢢⠑⢤⠁⡂⠌⠠
                                                            ⠬⣙⢖⠻⡔⡻⡨⠅⠉⢛⠿⠿⠿⠿⠿⣿⢿⣿⣯⣿⣿⢿⡿⣿⣿⣿⣿⣿⣿⣿⡿⠀⡗⢀⠀⠠⠀⡅⢺⣿⣿⡿⣿⣻⣿⣿⣿⡾⠿⠛⡿⠟⠋⠈⠄⢄⢲⠌⢄⠣⠤⢡⡁⠎⡁
                                                            ⣋⠵⣃⣝⡳⡱⢢⡠⠟⢼⣇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣦⠀⠄⠀⢀⡙⣿⣿⣿⡇⠀⡃⠀⠔⢄⢉⣧⣎⡿⠚⠛⠛⠉⠉⠀⠀⠀⠀⠀⠦⣀⣀⠤⡥⣤⠳⡐⢌⡐⠌⡀⠄⡀⢀
                                                            ⢬⠳⡃⠋⠐⠏⠁⠀⠂⠀⠈⠉⠙⠓⣷⣒⣒⡒⡒⣘⣉⣫⣿⠋⠻⠿⠿⠾⢟⢹⡃⠀⢱⢀⠈⢀⠜⠁⢲⠀⠀⠀⠀⣀⢀⠠⡀⢤⠰⡐⡌⢎⠁⢃⡑⣀⣣⢔⢠⡅⣒⢜⠢⡅⢂
                                                            ⠀⠀⠀⠁⡀⠄⠀⡀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠉⠉⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠑⣆⣢⡀⡎⣉⣁⣤⠶⡓⠆⠧⢚⠑⠎⣌⢣⢉⢂⣃⠱⢌⡖⣍⢃⠖⡵⠒⡭⡱⠙⠦⣉⡱⢌⡄
                                                            ⠀⠀⠁⢂⠐⡈⠰⣀⠡⡑⡈⠔⣐⢰⣀⠆⢢⡐⠤⡐⢄⢒⡔⢤⡂⠴⡠⢂⡔⣢⢔⢢⡚⠆⡒⢂⠀⠤⢩⢌⡑⡢⣜⠞⢲⡡⣏⢼⣝⢺⢏⠾⣜⠯⣖⠢⢏⠴⡡⠗⣚⠤⢃⡌⠄
                                                            ⠀⠀⠁⡀⢂⠈⡐⢄⠒⡁⠒⡌⢄⠢⢔⡘⡰⡐⡣⢌⡣⠜⡜⠢⣍⠳⡉⢍⠍⢂⡉⡠⡔⢸⣐⢥⢭⢖⡣⣌⣑⢣⣚⣞⡱⢞⡚⠷⢸⡍⣬⣓⣬⢷⣎⡳⣙⠖⣩⠙⡐⠌⠠⠀⠄
                                                            ⠀⠀⠀⠐⡀⢁⠢⠊⡄⢑⠢⠜⡠⢡⠢⠘⠤⠑⠢⠁⠎⡑⠌⡐⠀⣁⡄⣒⡬⣲⢞⡱⣛⢭⢘⢫⣓⠭⣷⣫⣽⢏⡷⣢⠍⡶⢩⡻⡭⣞⢧⢫⡖⣣⢚⡵⠍⢲⠱⡔⣀⠊⠄⠡⠀
                                                                                                                                   ''')
                                    elif choice9 == "2":
                                        print('''
                                                                       .######...####...######..##.....
                                                                      ...##....##..##....##....##.....
                                                                      ...##....######....##....##.....
                                                                      ...##....##..##....##....##.....
                                                                      ...##....##..##..######..######.
                                                                      ................................\n
                                                                       .#####...#####....####..
                                                                      .##..##..##..##..##..##.
                                                                      .#####...#####...##..##.
                                                                      .##..##..##..##..##..##.
                                                                      .#####...##..##...####..
                                                                      ........................\n
                                                                      .##..##...####...##..##.
                                                                      ..####...##..##..##..##.
                                                                      ...##....##..##..##..##.
                                                                      ...##....##..##..##..##.
                                                                      ...##.....####....####..
                                                                      ........................\n
                                                                      .##...##...####...##..##.
                                                                      .##...##..##..##..###.##.
                                                                      .##.#.##..##..##..##.###.
                                                                      .#######..##..##..##..##.
                                                                      ..##.##....####...##..##.
                                                                      .........................\n
                                                                      .##...##..##..##.
                                                                      .###.###...####..
                                                                      .##.#.##....##...
                                                                      .##...##....##...
                                                                      .##...##....##...
                                                                      .................\n
                                                                      .#####...##......######...####....####...######..##..##...####..
                                                                      .##..##..##......##......##......##........##....###.##..##.....
                                                                      .#####...##......####.....####....####.....##....##.###..##.###.
                                                                      .##..##..##......##..........##......##....##....##..##..##..##.
                                                                      .#####...######..######...####....####...######..##..##...####..
                                                                      ................................................................\n
                                                                      ..####...##..##..#####..
                                                                      .##..##..###.##..##..##.
                                                                      .######..##.###..##..##.
                                                                      .##..##..##..##..##..##.
                                                                      .##..##..##..##..#####..
                                                                      ........................\n
                                                                      ..####..
                                                                      .##..##.
                                                                      .######.
                                                                      .##..##.
                                                                      .##..##.
                                                                      ........\n

                                                                      ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠐⠠⠄⠄⠄⠀⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠄⢀⠀⠤⠠⠄⠠⠀⢀⠀⠀⠀⠀⠀⠀⠈⠀⠂⠐⠀⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠌⠀⠀⠀⡁⠀⠀⠁⠈⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠈⠄⠀⠐⠀⠀⠀⠀⠄⠀⠀⠀⠀⡀⠀⠄⠀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡐⠀⠀⠀⠠⠀⠀⠀⠀⠠⠀⠀⠀⠀⠀⠈⠀⠀⠀⠈⠐⡀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠂⡄⠁⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡀⣄⣄⢳⠶⣶⣶⠶⠶⠖⠶⠶⢶⡶⣶⣶⣶⣶⠤⢄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⢔⠋⠑⠙⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⢯⣾⣿⣿⣿⣿⣿⣿⣾⣕⡦⡀⠀⠀⠀⠀⠀⠀⠐⠀⠁⠠⠀⢂
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣄⡔⠉⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡏⡘⣫⣿⣿⣿⣿⣿⡼⣿⡿⢿⢘⣷⣄⣀⡀⠐⠀⠰⠀⠀⠐⠀⠂
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⣠⣤⣦⣪⣷⣶⣶⣶⣶⣶⣶⣲⣶⣶⣶⣶⣶⣶⣶⣶⣾⡟⣀⣨⣿⣭⣿⣿⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣷⠀⢀⠠⠀⠀⠀⠂⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠈⠠⠀⠀⠠⠀⠀
                                                            ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⣿⣿⢟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⢿⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠈⠹⣿⠀⠀⠀⠀⠀⠀⠀
                                                            ⠀⢀⠀⡀⢀⢀⡀⠄⣠⣀⣾⠀⠀⠀⣜⠀⠀⠀⠀⣹⣿⠯⠍⠛⠠⠀⠒⣲⢽⣿⣿⣻⠟⠉⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⡜⠉⢂⡟⠠⡀⠤⢀⠄⡀⢀
                                                            ⢌⡸⣨⠕⣎⠇⡌⡀⣿⣿⣿⣖⣦⣤⣿⣤⣤⣤⣴⣿⣿⣷⣶⣶⣶⣶⣶⣾⣿⣿⣿⠏⠀⠞⠁⠉⢄⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢠⢁⠄⠈⡗⢢⠑⢤⠁⡂⠌⠠
                                                            ⠬⣙⢖⠻⡔⡻⡨⠅⠉⢛⠿⠿⠿⠿⠿⣿⢿⣿⣯⣿⣿⢿⡿⣿⣿⣿⣿⣿⣿⣿⡿⠀⡗⢀⠀⠠⠀⡅⢺⣿⣿⡿⣿⣻⣿⣿⣿⡾⠿⠛⡿⠟⠋⠈⠄⢄⢲⠌⢄⠣⠤⢡⡁⠎⡁
                                                            ⣋⠵⣃⣝⡳⡱⢢⡠⠟⢼⣇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣦⠀⠄⠀⢀⡙⣿⣿⣿⡇⠀⡃⠀⠔⢄⢉⣧⣎⡿⠚⠛⠛⠉⠉⠀⠀⠀⠀⠀⠦⣀⣀⠤⡥⣤⠳⡐⢌⡐⠌⡀⠄⡀⢀
                                                            ⢬⠳⡃⠋⠐⠏⠁⠀⠂⠀⠈⠉⠙⠓⣷⣒⣒⡒⡒⣘⣉⣫⣿⠋⠻⠿⠿⠾⢟⢹⡃⠀⢱⢀⠈⢀⠜⠁⢲⠀⠀⠀⠀⣀⢀⠠⡀⢤⠰⡐⡌⢎⠁⢃⡑⣀⣣⢔⢠⡅⣒⢜⠢⡅⢂
                                                            ⠀⠀⠀⠁⡀⠄⠀⡀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠉⠉⠁⠁⠀⠀⠀⠀⠀⠀⠀⠀⠑⣆⣢⡀⡎⣉⣁⣤⠶⡓⠆⠧⢚⠑⠎⣌⢣⢉⢂⣃⠱⢌⡖⣍⢃⠖⡵⠒⡭⡱⠙⠦⣉⡱⢌⡄
                                                            ⠀⠀⠁⢂⠐⡈⠰⣀⠡⡑⡈⠔⣐⢰⣀⠆⢢⡐⠤⡐⢄⢒⡔⢤⡂⠴⡠⢂⡔⣢⢔⢢⡚⠆⡒⢂⠀⠤⢩⢌⡑⡢⣜⠞⢲⡡⣏⢼⣝⢺⢏⠾⣜⠯⣖⠢⢏⠴⡡⠗⣚⠤⢃⡌⠄
                                                            ⠀⠀⠁⡀⢂⠈⡐⢄⠒⡁⠒⡌⢄⠢⢔⡘⡰⡐⡣⢌⡣⠜⡜⠢⣍⠳⡉⢍⠍⢂⡉⡠⡔⢸⣐⢥⢭⢖⡣⣌⣑⢣⣚⣞⡱⢞⡚⠷⢸⡍⣬⣓⣬⢷⣎⡳⣙⠖⣩⠙⡐⠌⠠⠀⠄
                                                            ⠀⠀⠀⠐⡀⢁⠢⠊⡄⢑⠢⠜⡠⢡⠢⠘⠤⠑⠢⠁⠎⡑⠌⡐⠀⣁⡄⣒⡬⣲⢞⡱⣛⢭⢘⢫⣓⠭⣷⣫⣽⢏⡷⣢⠍⡶⢩⡻⡭⣞⢧⢫⡖⣣⢚⡵⠍⢲⠱⡔⣀⠊⠄⠡⠀''')
                                    else:
                                        print("Bye")
                            else:
                                print("YO! U got low IQ mate 😕 Sorry, try again or ask the developer for help.")
                        else:
                            print(
                                "Wrong! Only family and manager were allowed in. How did the employee discover the body? YOU LOSE 😃")
                    else:
                        print(
                            "Wrong choice! Animals can survive without food for months, but not a psycho killer. Game over.")
                else:
                    print("Friendly polar bear? Nah bro, they tear flesh for fun. You're out 🙄")
            else:
                print("You freakin loser decided to quit huh? YOU KNOW WHAT YOU DESERVED TO LOSE 🤬")
        else:
            print("Wrong move, poor mindset. Game over 🫢")
    else:
        print("Game Over. Wrong path. Bad intuition 😒")

    choice = input("\nPress Enter to exit, or type 'play' to run again: ")
    if choice.strip().lower() != 'play':
        print("Thanks for playing! Goodbye.")
        break